STATUS = (
    ('00', '정상'),
    ('01', '업종변경'),
    ('02', '사업자번호 폐업후 재사용'),
    ('03', '피흡수합병'),
    ('11', '법인전환'),
    ('12', '조직변경'),
    ('13', '상속')
)

IDENTIFIY = (
    ('1', '일반법인'),
    ('2', '공공기관'),
    ('3', '비영리법인'),
    ('8', '기타법인'),
    ('9', '개인')
)

COMPANY_SIZE = (
    ('1', '대기업'),
    ('2', '중소기업'),
    ('3', '중견기업'),
    ('4', '대상아님'),
)

MARKET_CODE = (
    ('1', '코스피'),
    ('2', '코스피'),
    ('3', '코넥스'),
)

ISSUES_ADMIN = (
    ('Y', '관리종목'),
    ('N', '정상')
)

EXTERNAL_AUDIT = (
    ('Y', '외부감사대상'),
    ('N', '외부감사비대상')
)

COMPANY_EXISTENCE = (
    ('Y', 'LIVE'),
    ('N', 'DIE')
)

FINANCE_DIV = (
    ('00' ,'제조'),
    ('AA', '은행'),
    ('BB', '증권'),
    ('CC', '생보'),
    ('DD', '손보'),
    ('EE', '신용금고'),
    ('FF', '종금'),
    ('GG', '투신'),
    ('HH', '리스'),
    ('II', '카드'),
    ('JJ', '창투'),
    ('KK', '할부금융'),
    ('ZZ', '기타')
)

CLOSURE_STATUS = (
    ('Y', 'LIVE'),
    ('N', 'DIE')
)

STOCK_TYPE = (
    ('1', '보통주'),
    ('2', '우선주'),
    ('3', '합계'),
    ('4', '기타주식')
)

SETTLEMENT_TYPE = (
    ('1', '결산'),
    ('2', '반기'),
    ('3', '기타'),
    ('4', '1Q'),
    ('5', '3Q'),
)

CR_CODE = (
    ('10','정리절차신청'),
    ('11','정리절차개시결정'),
    ('12','정리계획인가'),
    ('13','정리절차종결'),
    ('14','정리절차폐지'),
    ('20','화의개시신청'),
    ('21','화의개시'),
    ('22','화의인가'),
    ('23','화의취소'),
    ('24','화의종료'),
    ('31','워크아웃선정'),
    ('32','워크아웃중단'),
    ('33','워크아웃졸업'),
    ('34','워크아웃자율'),
    ('35','워크아웃신청'),
    ('36','워크아웃개시'),
    ('39','워크아웃합병'),
    ('40','회생절차개시신청'),
    ('41','회생절차개시결정'),
    ('42','회생계획인가'),
    ('43','회생정리절차종결'),
    ('44','회생정리절차폐지'),
    ('45','회생계획불인가'),
    ('46','회생절차개시신청취하'),
    ('47','포괄적금지명령공고'),
    ('48','포괄적금지명령취소공고'),
    ('49','회생절차폐지결정취소공고')
)

USE_BINARY = (
    ('O', '사용'),
    ('X', '미사용')
)

# ab01, ad01 -> SETTLEMENT_TYPE
SETTLEMENT_TYPE2 = (
    ('K', '결산'),
    ('B', '반기'),
    ('F', '1Q'),
    ('T', '3Q'),
)
