STATUS = (
    ('00', '정상'),
    ('01', '업종변경'),
    ('02', '사업자번호 폐업후 재사용'),
    ('03', '피흡수합병'),
    ('11', '법인전환'),
    ('12', '조직변경'),
    ('13', '상속')
)

IDENTIFIY = (
    ('1', '일반법인'),
    ('2', '공공기관'),
    ('3', '비영리법인'),
    ('8', '기타법인'),
    ('9', '개인')
)

COMPANY_SIZE = (
    ('1', '대기업'),
    ('2', '중소기업'),
    ('3', '중견기업'),
    ('4', '대상아님'),
)

MARKET_CODE = (
    ('1', '코스피'),
    ('2', '코스피'),
    ('3', '코넥스'),
)

ISSUES_ADMIN = (
    ('Y', '관리종목'),
    ('N', '정상')
)

EXTERNAL_AUDIT = (
    ('Y', '외부감사대상'),
    ('N', '외부감사비대상')
)

COMPANY_EXISTENCE = (
    ('Y', 'LIVE'),
    ('N', 'DIE')
)

FINANCE_DIV = (
    ('00' ,'제조'),
    ('AA', '은행'),
    ('BB', '증권'),
    ('CC', '생보'),
    ('DD', '손보'),
    ('EE', '신용금고'),
    ('FF', '종금'),
    ('GG', '투신'),
    ('HH', '리스'),
    ('II', '카드'),
    ('JJ', '창투'),
    ('KK', '할부금융'),
    ('ZZ', '기타')
)

CLOSURE_STATUS = (
    ('Y', 'LIVE'),
    ('N', 'DIE')
)

STOCK_TYPE = (
    ('1', '보통주'),
    ('2', '우선주'),
    ('3', '합계'),
    ('4', '기타주식')
)

SETTLEMENT_TYPE = (
    ('1', '결산'),
    ('2', '반기'),
    ('3', '기타'),
    ('4', '1Q'),
    ('5', '3Q'),
)

CR_CODE = (
    ('10','정리절차신청'),
    ('11','정리절차개시결정'),
    ('12','정리계획인가'),
    ('13','정리절차종결'),
    ('14','정리절차폐지'),
    ('20','화의개시신청'),
    ('21','화의개시'),
    ('22','화의인가'),
    ('23','화의취소'),
    ('24','화의종료'),
    ('31','워크아웃선정'),
    ('32','워크아웃중단'),
    ('33','워크아웃졸업'),
    ('34','워크아웃자율'),
    ('35','워크아웃신청'),
    ('36','워크아웃개시'),
    ('39','워크아웃합병'),
    ('40','회생절차개시신청'),
    ('41','회생절차개시결정'),
    ('42','회생계획인가'),
    ('43','회생정리절차종결'),
    ('44','회생정리절차폐지'),
    ('45','회생계획불인가'),
    ('46','회생절차개시신청취하'),
    ('47','포괄적금지명령공고'),
    ('48','포괄적금지명령취소공고'),
    ('49','회생절차폐지결정취소공고')
)

USE_BINARY = (
    ('O', '사용'),
    ('X', '미사용')
)

# ab01, ad01 -> SETTLEMENT_TYPE
SETTLEMENT_TYPE2 = (
    ('K', '결산'),
    ('B', '반기'),
    ('F', '1Q'),
    ('T', '3Q')
)

# REFERRAL_CHOICHES
BS_REPORT = (
    ('11', '대차대조표'),
    ('12', '손익계산서'),
    ('13', '이익잉여금처분계산서'),
    ('14', '재무상태변동표'),
    ('15', '제조원가명세서'),
    ('16', '현금흐름표'),
    ('17', '현금흐름분석'),
    ('18', '손익분기분석'),
    ('19', '재무비율'),
    ('20', '요약재무분석'),
    ('22', '종합원가분석'),
    ('26', '자본변통표'),
    ('27', '현금수지분석표'),
    ('29', '현금수지분석표2'),
    ('A1', '은행_재무상태표'),
    ('A2', '은행_손익계산서'),
    ('A3', '은행_이익잉여금처분계산서'),
    ('A4', '은행_현금흐름표'),
    ('A6', '은행_자본변동표'),
    ('A9', '은행_현금흐름표'),
    ('B1', '증권_재무상태표'),
    ('B2', '증권_손익계산서'),
    ('B3', '증권_이익잉여금처분계산서'),
    ('B4', '증권_현금흐름표'),
    ('B6', '증권_자본변동표'),
    ('B9', '증권_현금흐름표'),
    ('C1', '생보_재무상태표'),
    ('C2', '생보_손익계산서'),
    ('C3', '생보_이익잉여금처분계산서'),
    ('C4', '생보_현금흐름표'),
    ('C6', '생보_자본변동표'),
    ('C9', '생보_현금흐름표'),
    ('D1', '손보_재무상태표'),
    ('D2', '손보_손익계산서'),
    ('D3', '손보_이익잉여금처분계산서'),
    ('D4', '손보_현금흐름표'),
    ('D6', '손보_자본변동표'),
    ('D9', '손보_현금흐름표'),
    ('E1', '신용금고_재무상태표'),
    ('E2', '신용금고_손익계산서'),
    ('E3', '신용금고_이익잉여금처분계산서'),
    ('E4', '신용금고_현금흐름표'),
    ('E6', '신용금고_자본변동표'),
    ('E9', '신용금고_현금흐름표'),
    ('F1', '종합금융_재무상태표'),
    ('F2', '종합금융_손익계산서'),
    ('F3', '종합금융_이익잉여금처분계산서'),
    ('F4', '종합금융_현금흐름표'),
    ('F6', '종합금융_자본변동표'),
    ('F9', '종합금융_현금흐름표'),
    ('G1', '투자신탁_재무상태표'),
    ('G2', '투자신탁_손익계산서'),
    ('G3', '투자신탁_이익잉여금처분계산서'),
    ('G4', '투자신탁_현금흐름표'),
    ('G6', '투자신탁_자본변동표'),
    ('G9', '투자신탁_현금흐름표'),
    ('H1', '리스_재무상태표'),
    ('H2', '리스_손익계산서'),
    ('H3', '리스_이익잉여금처분계산서'),
    ('H4', '리스_현금흐름표'),
    ('H6', '리스_자본변동표'),
    ('H9', '리스_현금흐름표'),
    ('I1', '카드_재무상태표'),
    ('I2', '카드_손익계산서'),
    ('I3', '카드_이익잉여금처분계산서'),
    ('I4', '카드_현금흐름표'),
    ('I6', '카드_자본변동표'),
    ('I9', '카드_현금흐름표'),
    ('J1', '창업투자_재무상태표'),
    ('J2', '창업투자_손익계산서'),
    ('J3', '창업투자_이익잉여금처분계산서'),
    ('J4', '창업투자_현금흐름표'),
    ('J6', '창업투자_자본변동표'),
    ('J9', '창업투자_현금흐름표'),
    ('K1', '창업투자_재무상태표'),
    ('K2', '창업투자_손익계산서'),
    ('K3', '창업투자_이익잉여금처분계산서'),
    ('K4', '창업투자_현금흐름표'),
    ('K6', '창업투자_자본변동표'),
    ('K9', '창업투자_현금흐름표'),
    ('Z1', '창업투자_재무상태표'),
    ('Z2', '창업투자_손익계산서'),
    ('Z3', '창업투자_이익잉여금처분계산서'),
    ('Z4', '창업투자_현금흐름표'),
    ('Z6', '창업투자_자본변동표'),
    ('Z9', '창업투자_현금흐름표'),
)

# em02
BP_CODE = (
    ('01', '본사'),
    ('02', '공장'),
    ('03', '영업소(사무소)'),
    ('05', '지점(출장소)'),
    ('09', '기타')
)

CLOSURE_CODE = (
    ('Y', '폐업'),
    ('N', '정상'),
    ('X', '미확인')
)
